
export default [
    {
      id: 'q1',
      text: 'Яке з наведених нижче визначень найкраще описує React.js?',
      answers: [
        'Бібліотека для створення інтерфейсів користувача за допомогою декларативного коду.',
        'Бібліотека для керування станом у веб-додатках.',
        'Фреймворк для створення інтерфейсів користувача за допомогою імперативного коду.',
        'Бібліотека, яка використовується лише для створення мобільних програм.',
      ],
    },
    {
      id: 'q2',
      text: 'Якій меті служать хуки React?',
      answers: [
        'Дозволяє використовувати стан та інші функції React у функціональних компонентах.',
        'Створення адаптивних макетів у програмах React.',
        'Обробка помилок у програмі.',
        'Частина бібліотеки Redux для керування глобальним станом.',
      ],
    },
    {
      id: 'q3',
      text: 'Чи можете ви визначити, що таке JSX?',
      answers: [
        'Розширення JavaScript, яке додає до JavaScript синтаксис, подібний до HTML.',
        'Бібліотека JavaScript для створення динамічних інтерфейсів користувача.',
        'Спеціальна версія HTML, яка була явно створена для React.',
        'Інструмент для створення HTTP-запитів у програмі React.',
      ],
    },
    {
      id: 'q4',
      text: 'Який найпоширеніший спосіб створення компонента в React?',
      answers: [
        'Визначивши функцію JavaScript, яка повертає відтворюване значення.',
        'Визначивши спеціальний тег HTML у JavaScript.',
        'Створивши файл із розширенням .jsx.',
        'Використовуючи ключове слово "new", за яким слідує назва компонента.',
      ],
    },
    {
      id: 'q5',
      text: 'Що означає термін «стан в реакті»?',
      answers: [
        'Об’єкт у компоненті, який зберігає значення та може призвести до відтворення компонента при зміні.',
        'Фаза життєвого циклу, на якій перебуває компонент React.',
        'Загальний статус програми React, включаючи всі властивості та компоненти.',
        'Бібліотека для керування глобальним станом у програмах React.',
      ],
    },
    {
      id: 'q6',
      text: 'Як ви зазвичай відтворюєте вміст списку в програмах React?',
      answers: [
        'За допомогою методу map() для перебору масиву даних і повернення JSX.',
        'За допомогою циклу for() для перебору масиву даних і повернення JSX.',
        'За допомогою методу forEach() для повторення масиву даних і повернення JSX.',
        'За допомогою методу loop() для повторення масиву даних і повернення JSX.',
      ],
    },
    {
      id: 'q7',
      text: 'Який підхід НЕ можна використовувати для умовного відтворення вмісту?',
      answers: [
        'Використання синтаксису шаблону #if.',
        'Використання тернарного оператора.',
        'Використання оператора &&.',
        'Використання оператора if-else.',
      ],
    },
  ];